ningjw/LPC55S69/core0/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t ADC_MODE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin G5)  */
    GPIO_PinInit(BOARD_INITPINS_ADC_MODE_GPIO, BOARD_INITPINS_ADC_MODE_PORT, BOARD_INITPINS_ADC_MODE_PIN, &ADC_MODE_config);

    gpio_pin_config_t ADC_SYNC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin J2)  */
    GPIO_PinInit(BOARD_INITPINS_ADC_SYNC_GPIO, BOARD_INITPINS_ADC_SYNC_PORT, BOARD_INITPINS_ADC_SYNC_PIN, &ADC_SYNC_config);

    gpio_pin_config_t PWR_OFF_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin E12)  */
    GPIO_PinInit(BOARD_INITPINS_PWR_OFF_GPIO, BOARD_INITPINS_PWR_OFF_PORT, BOARD_INITPINS_PWR_OFF_PIN, &PWR_OFF_config);

    gpio_pin_config_t PWR_5V_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin A11)  */
    GPIO_PinInit(BOARD_INITPINS_PWR_5V_GPIO, BOARD_INITPINS_PWR_5V_PORT, BOARD_INITPINS_PWR_5V_PIN, &PWR_5V_config);

    gpio_pin_config_t TEMP_ALT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin G11)  */
    GPIO_PinInit(BOARD_INITPINS_TEMP_ALT_GPIO, BOARD_INITPINS_TEMP_ALT_PORT, BOARD_INITPINS_TEMP_ALT_PIN, &TEMP_ALT_config);

    gpio_pin_config_t LED1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin G12)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_PORT, BOARD_INITPINS_LED1_PIN, &LED1_config);

    gpio_pin_config_t LED2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin G13)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_PORT, BOARD_INITPINS_LED2_PIN, &LED2_config);

    gpio_pin_config_t PWR_AL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin H5)  */
    GPIO_PinInit(BOARD_INITPINS_PWR_AL_GPIO, BOARD_INITPINS_PWR_AL_PORT, BOARD_INITPINS_PWR_AL_PIN, &PWR_AL_config);

    gpio_pin_config_t PWR_3V_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin J7)  */
    GPIO_PinInit(BOARD_INITPINS_PWR_3V_GPIO, BOARD_INITPINS_PWR_3V_PORT, BOARD_INITPINS_PWR_3V_PIN, &PWR_3V_config);

    gpio_pin_config_t BAT_STDBY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin B3)  */
    GPIO_PinInit(BOARD_INITPINS_BAT_STDBY_GPIO, BOARD_INITPINS_BAT_STDBY_PORT, BOARD_INITPINS_BAT_STDBY_PIN, &BAT_STDBY_config);

    gpio_pin_config_t LED3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin L7)  */
    GPIO_PinInit(BOARD_INITPINS_LED3_GPIO, BOARD_INITPINS_LED3_PORT, BOARD_INITPINS_LED3_PIN, &LED3_config);

    gpio_pin_config_t LED4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_15 (pin B6)  */
    GPIO_PinInit(BOARD_INITPINS_LED4_GPIO, BOARD_INITPINS_LED4_PORT, BOARD_INITPINS_LED4_PIN, &LED4_config);

    gpio_pin_config_t BAT_CHRG_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin C7)  */
    GPIO_PinInit(BOARD_INITPINS_BAT_CHRG_GPIO, BOARD_INITPINS_BAT_CHRG_PORT, BOARD_INITPINS_BAT_CHRG_PIN, &BAT_CHRG_config);

    gpio_pin_config_t LED5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin H13)  */
    GPIO_PinInit(BOARD_INITPINS_LED5_GPIO, BOARD_INITPINS_LED5_PORT, BOARD_INITPINS_LED5_PIN, &LED5_config);

    gpio_pin_config_t LED6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_20 (pin C2)  */
    GPIO_PinInit(BOARD_INITPINS_LED6_GPIO, BOARD_INITPINS_LED6_PORT, BOARD_INITPINS_LED6_PIN, &LED6_config);

    gpio_pin_config_t NB_PWR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_24 (pin F6)  */
    GPIO_PinInit(BOARD_INITPINS_NB_PWR_GPIO, BOARD_INITPINS_NB_PWR_PORT, BOARD_INITPINS_NB_PWR_PIN, &NB_PWR_config);

    gpio_pin_config_t BT_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_25 (pin B8)  */
    GPIO_PinInit(BOARD_INITPINS_BT_RST_GPIO, BOARD_INITPINS_BT_RST_PORT, BOARD_INITPINS_BT_RST_PIN, &BT_RST_config);

    gpio_pin_config_t BT_PWR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin E13)  */
    GPIO_PinInit(BOARD_INITPINS_BT_PWR_GPIO, BOARD_INITPINS_BT_PWR_PORT, BOARD_INITPINS_BT_PWR_PIN, &BT_PWR_config);

    gpio_pin_config_t BT_MODE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_27 (pin E8)  */
    GPIO_PinInit(BOARD_INITPINS_BT_MODE_GPIO, BOARD_INITPINS_BT_MODE_PORT, BOARD_INITPINS_BT_MODE_PIN, &BT_MODE_config);

